#Comment บรรทัดเดียว
"""Comment หลายบรรทัด"""

"""
week03.py
int  จำนวนเต็ม
float  จำนวนทศนิยม
char ตัวอักษร
string ข้อความ
"""
#-------------------------------------

"""x = input() #รับค่าไปใส่ที่ตัวแปร X
print(type(x)) #แสดงชนิดข้อมูลของตัวแปร X ที่รับค่ามาเก็บไว้
x = float(x) #เปลี่ยนข้อมูลในตัวแปร X เป็น float
print(type(x)) #แสดงชนิดข้อมูลของตัวแปร X ที่รับค่ามาเก็บไว้"""

#-------------------------------------


x = 10 #กำหนดค่าให้ตัวแปร X มีค่าเท่ากับ 10
y = 3 #กำหนดค่าให้ตัวแปร X มีค่าเท่ากับ 3
print(x+y)          #13
print(type(x+y))    #<class 'int'>
print(x-y)          #7
print(type(x-y))    #<class 'int'>
print(x*y)          #30
print(type(x*y))    #<class 'int'>
print(x/y)          #3.3333333333333335
print(type(x/y))    #<class 'int'>
print(x**y)         #1000   //ยกกำลัง
print(type(x**y))   #<class 'int'>
print(x%y)          #1      //หารเอาเศษ
print(type(x%y))    #<class 'int'>
print(x//y)          #1      //หารเอาจำนวนเต็ม
print(type(x%y))    #<class 'int'>


"""
+  บวก
-  ลบ
*  คุณ
** ยกกำลัง
/  หาร (เลขทศนิยม)
// หารเอาจำนวนเต็ม
%  หารเอาจำนวนทศนิยม
"""

#-------------------------------------
print("-------------------------------------")

#คำนวณพื้นที่ของสี่เหลี่ยมผืนผ้า
print("โปรแกรมคำนวณพื้นที่ของสี่เหลี่ยมผืนผ้า")
print("ใส่ความกว้าง")
m = input()
print("ใส่ความยาว")
n = input()
m = int(m)
n = int(n)
print("พื้นที่ของสี่เหลี่ยมผืนผ้าคือ",m*n)

#-------------------------------------
print("-------------------------------------")

#คำนวณหาพื้นที่ของวงกลม
print("โปรแกรมคำนวณหาพื้นที่ของวงกลม")
print("ใส่รัศมีของวงกลม")
r = input()
r = int(r)
print("พื้นที่ของวงกลมคือ",3.14*(r**2))

#-------------------------------------
print("-------------------------------------")

#คำนวณหาพื้นที่ของสี่เหลี่ยมคางหมู
print("โปรแกรมคำนวณหาพื้นที่ของสี่เหลี่ยมคางหมู")
print("ด้านคู่ขนานด้านยาว :")
a = input()
a = int(a)
print("ด้านคู่ขนานด้านสั้น :")
b = input()
b = int(b)
print("ด้านคู่ขนานด้านสูง :")
c = input()
c = int(c)
print("พื้นที่ของสี่เหลี่ยมคางหมูคือ",1/2*((a+b)*c))